{"pageProps":{"source":{"compiledSource":"var d=Object.defineProperty,p=Object.defineProperties;var u=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var c=(e,o,s)=>o in e?d(e,o,{enumerable:!0,configurable:!0,writable:!0,value:s}):e[o]=s,a=(e,o)=>{for(var s in o||(o={}))i.call(o,s)&&c(e,s,o[s]);if(n)for(var s of n(o))r.call(o,s)&&c(e,s,o[s]);return e},h=(e,o)=>p(e,u(o));var l=(e,o)=>{var s={};for(var t in e)i.call(e,t)&&o.indexOf(t)<0&&(s[t]=e[t]);if(e!=null&&n)for(var t of n(e))o.indexOf(t)<0&&r.call(e,t)&&(s[t]=e[t]);return s};const makeShortcode=e=>function(s){return console.warn(\"Component \"+e+\" was not imported, exported, or provided by MDXProvider as global scope\"),mdx(\"div\",a({},s))},AssetLinks=makeShortcode(\"AssetLinks\"),AssetLink=makeShortcode(\"AssetLink\"),TableOfContents=makeShortcode(\"TableOfContents\"),layoutProps={},MDXLayout=\"wrapper\";function MDXContent(s){var t=s,{components:e}=t,o=l(t,[\"components\"]);return mdx(MDXLayout,h(a(a({},layoutProps),o),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h1\",null,\"Iconography\"),mdx(\"p\",null,\"Fabric icons are clear, minimal, and consistent across all platforms. They follow the focused and rational principles of our design system in both metaphor and style. Icons can be viewed on the \",mdx(\"a\",a({parentName:\"p\"},{href:\"/icons\"}),\"Icons page\"),\".\"),mdx(AssetLinks,{mdxType:\"AssetLinks\"},mdx(AssetLink,{href:\"https://www.figma.com/file/1qkEGDQWaftkOL7C360qVD/Fabric-Icons\",mdxType:\"AssetLink\"})),mdx(TableOfContents,{mdxType:\"TableOfContents\"}),mdx(\"h2\",null,\"Characteristics\"),mdx(\"h3\",null,\"Metaphors\"),mdx(\"p\",null,\"FINN products often contain lots of information, so our icon metaphors are simple, clear, and additive to experiences. They describe tools and topics as simply and accurately as possible. Icons that attempt to relay too much information often become busy and don't read well at small sizes.\"),mdx(\"p\",null,\"We use existing metaphors whenever possible to maintain consistency between products and also to help avoid confusion for users. Metaphors don't change based on operating system, with the exception of specific icons that follow platform standards.\"),mdx(\"h3\",null,\"Platform-specific\"),mdx(\"p\",null,'Fabric is multi-platform, so we ensure that our icons are as similar as possible across all platforms. Some icons are particularly prevalent on specific platforms. In these rare cases, it\\u2019s beneficial to follow the system\\u2019s established metaphors, so we provide platform-specific icons (e.g., \"share\").'),mdx(\"h3\",null,\"Appearance\"),mdx(\"p\",null,\"Most icons are stroked and have a fixed stroke width, to ensure that they have a consistent look feel. There are a small number of filled icons which are used in specific edge-cases, these are usually icons of smaller sizes, where the detail of stroked icons becomes too complex.\"),mdx(\"h3\",null,\"Color\"),mdx(\"p\",null,\"Fabric icons are monochromatic. The icon color varies depending on the interactive state (e.g., default, hover, disabled) and the color theme.\"),mdx(\"h3\",null,\"Sizes\"),mdx(\"p\",null,\"Fabric standard icons sizes are 24px, and we have some mini icons of 16px16px. These should are designed to be used at these sizes and should not be scaled. These icons are used on all platforms and screen sizes. We have some other custom icons at other sizes that should only be used in their specific use-cases. eg. market icons on the FINN home page.\"),mdx(\"h3\",null,\"Layout\"),mdx(\"p\",null,\"Icon designs include a safe area to ensure flexibility for finding the best positioning and balance in a layout.\"),mdx(\"h3\",null,\"Pixel snapping\"),mdx(\"p\",null,\"Icons are snapped to a half pixel to allow for higher screen resolution. On rare occasions, an icon may be off-center in order to place it exactly on a grid.\"),mdx(\"h3\",null,\"Stroke width\"),mdx(\"p\",null,\"Icons have a 1.5 px stroke width and are center-aligned.\"),mdx(\"h3\",null,\"Corner radius\"),mdx(\"p\",null,\"Icons have a rounded corner treatment, giving them an easy-on-the-eye, and friendly form, aligning it with the other visual elements.\"),mdx(\"h3\",null,\"Interactivity\"),mdx(\"p\",null,'Icons can be interactive or static. Interactive icons can be used either alone or combined with text. For example, a trashcan icon for deleting content, or a heart to add to favorites. Static icons are used in combination with text, to help highlight and visually reinforce the information the text is providing. For example a \"speedometer\" icon next to the information about mileage.'),mdx(\"h2\",null,\"Usage guidelines\"),mdx(\"h3\",null,\"Respect an icon's stroke\"),mdx(\"p\",null,\"Fabric icons are designed to have a similar visual weight when used next to one another. The weight of their strokes is designed specifically to be balanced with typography and other UI elements. The stroke width should not be changed and icons should not be scaled.\"),mdx(\"h3\",null,\"Don't scale icons\"),mdx(\"p\",null,\"Every single icon is pixel-snapped for its specific size, so scaling icons to suit your design is not allowed. This can cause the proportions to be off-balance and can disrupt the already established and intended visual hierarchy. Icons are carefully designed to have consistent stroke weights, corner radii, and proportions at each size.\"),mdx(\"h3\",null,\"Be careful when using letters in icons\"),mdx(\"p\",null,\"Letters in an icon design usually don\\u2019t scale for global audiences, since words for metaphors differ across languages. An icon that uses a letter in one language in order to convey a metaphor may not be understood by those who do not speak that language.\"),mdx(\"p\",null,'It\\u2019s acceptable to use letters in icons only when the icon is conveying a standardized concept, such as \\u201Cbold,\\u201D \\u201Citalic,\\u201D \\u201Cunderline,\\u201D or a tag in code. Or for example \"Kr\" which is used in to indicate \"Kroner\" in Norway.'))}MDXContent.isMDXComponent=!0;\n","scope":{}}},"__N_SSG":true}