{"pageProps":{"source":{"compiledSource":"var h=Object.defineProperty,p=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var o=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var l=(e,t,i)=>t in e?h(e,t,{enumerable:!0,configurable:!0,writable:!0,value:i}):e[t]=i,a=(e,t)=>{for(var i in t||(t={}))s.call(t,i)&&l(e,i,t[i]);if(o)for(var i of o(t))r.call(t,i)&&l(e,i,t[i]);return e},d=(e,t)=>p(e,m(t));var u=(e,t)=>{var i={};for(var n in e)s.call(e,n)&&t.indexOf(n)<0&&(i[n]=e[n]);if(e!=null&&o)for(var n of o(e))t.indexOf(n)<0&&r.call(e,n)&&(i[n]=e[n]);return i};const makeShortcode=e=>function(i){return console.warn(\"Component \"+e+\" was not imported, exported, or provided by MDXProvider as global scope\"),mdx(\"div\",a({},i))},Imagefullwidth=makeShortcode(\"Imagefullwidth\"),AssetLinks=makeShortcode(\"AssetLinks\"),AssetLink=makeShortcode(\"AssetLink\"),TableOfContents=makeShortcode(\"TableOfContents\"),Guideline=makeShortcode(\"Guideline\"),layoutProps={},MDXLayout=\"wrapper\";function MDXContent(i){var n=i,{components:e}=n,t=u(n,[\"components\"]);return mdx(MDXLayout,d(a(a({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h1\",null,\"Input\"),mdx(\"p\",null,`Input, which are often referred to as Text fields, are text boxes that allow\nusers to input custom text entries with a keyboard. Various options can be shown\nwith the field to communicate the input requirements.`),mdx(Imagefullwidth,{image:\"input-hero.svg\",title:\"Input example\",mdxType:\"Imagefullwidth\"}),mdx(AssetLinks,{mdxType:\"AssetLinks\"},mdx(AssetLink,{href:\"https://react.fabric-ds.io/textfield\",mdxType:\"AssetLink\"}),mdx(AssetLink,{href:\"https://vue.fabric-ds.io/forms\",mdxType:\"AssetLink\"})),mdx(TableOfContents,{mdxType:\"TableOfContents\"}),mdx(\"h2\",null,\"Anatomy\"),mdx(Imagefullwidth,{image:\"input-anatomy.svg\",title:\"Input anatomy example\",mdxType:\"Imagefullwidth\"}),mdx(\"h2\",null,\"Options\"),mdx(Guideline,{title:\"Label\",image:\"input-options-label.svg\",mdxType:\"Guideline\"},\"Inputs should always have a label. The only exceptions to this rule are search fields, and message input fields which can be more easily understood in their layout context. For numerical inputs, always include the unit type in the label to clarify what type of input information is needed, e.g. (cm, kg)\"),mdx(Guideline,{title:\"Label position\",image:\"input-options-label-position.svg\",mdxType:\"Guideline\"},\"Labels should be placed on top of the input. Top labels are recommended because they help anchor form components to a left margin, making it easier to scan a form. They also allow room for more descriptive text, and responsive layouts.\"),mdx(Guideline,{title:\"Placeholder\",image:\"input-options-placeholder.svg\",mdxType:\"Guideline\"},\"The placeholder text, also commonly known as \\u201Cghost text,\\u201D is temporary and disappears once a user enters text. This should only be used to give the user a hint of what kind of information, and in what format they should enter their text. Including instructions, requirements, or other detailed information into placeholder text is not accessible (as it disappears as soon as the user type ssomething else) and hence not recommended. Help text is the preferred way to communicate this information. Never use placeholder text instead of a label.\"),mdx(Guideline,{title:\"Value\",image:\"input-options-value.svg\",mdxType:\"Guideline\"},\"The value shows a user\\u2019s entered text.\"),mdx(Guideline,{title:\"Width\",image:\"input-options-width.svg\",mdxType:\"Guideline\"},\"The width of an input can be customized appropriately for its context. For example, when asking for a telephone number, the input field should be wide enough to accomodate the maximum number of digits, but no wider.\"),mdx(Guideline,{title:\"Required or optional\",image:\"input-options-required-or-optional.svg\",mdxType:\"Guideline\"},\"inputs can be marked as optional when user input is not required. Optional inputs are denoted with text added to the end of the label \\u2014 \\u201C(optional)\\u201D.\"),mdx(Guideline,{title:\"Error\",image:\"input-options-error.svg\",mdxType:\"Guideline\"},\"An input can be marked as having an error to show that a value needs to be entered in order to move forward or that a value that was entered is invalid.\"),mdx(Guideline,{title:\"Disabled\",image:\"input-options-disabled.svg\",mdxType:\"Guideline\"},\"An input in a disabled state shows that an input field exists, but is not available in that circumstance. This can be used to maintain layout continuity and communicate that a field may become available later.\"),mdx(Guideline,{title:\"Read-only\",image:\"input-options-read-only.svg\",mdxType:\"Guideline\"},\"Inputs have a read-only option for when content in the disabled state still needs to be shown. This allows for content to be copied, but not interacted with or changed. An input does not have a read-only option if there is nothing entered in it.\"),mdx(Guideline,{title:\"Help text (description and error message)\",image:\"input-options-help-text.svg\",mdxType:\"Guideline\"},\"An input can have help text below the field to give extra context or instruction about what a user should input in the field. The help text area has two options: a description and an error message. The description communicates a hint or helpful information, such as specific requirements for correctly filling out the field. The error message communicates an error for when the field requirements aren\\u2019t met, prompting a user to adjust what they had originally input. Keep help text short and informative and guide the user to the source of information when possible.\"),mdx(\"h2\",null,\"Behaviors\"),mdx(Guideline,{title:\"Text overflow\",image:\"input-behaviors-text-overflow.svg\",mdxType:\"Guideline\"},\"When the field label is too long for the available horizontal space, it wraps to form another line. The field text itself truncates.\"),mdx(Guideline,{title:\"Help text overflow\",image:\"input-behaviors-help-text-overflow.svg\",mdxType:\"Guideline\"},\"When the help text is too long for the available horizontal space, it wraps to form another line.\"),mdx(\"h2\",null,\"Usage guidelines\"),mdx(Guideline,{title:\"Include a label\",image:\"input-usage-guidelines-1-do.svg\",good:!0,mdxType:\"Guideline\"},\"Every input should have a label. A field without a label is ambiguous and not accessible.\"),mdx(Guideline,{image:\"input-usage-guidelines-1-dont.svg\",bad:!0,mdxType:\"Guideline\"}),mdx(Guideline,{title:\"Follow capitalization rules\",image:\"input-usage-guidelines-2-do.svg\",good:!0,mdxType:\"Guideline\"},\"Field labels and placeholder text should be in sentence case.\"),mdx(Guideline,{image:\"input-usage-guidelines-2-dont.svg\",bad:!0,mdxType:\"Guideline\"}),mdx(Guideline,{title:\"Mark the minority of inputs in a form as required or optional\",image:\"input-usage-guidelines-3-do.svg\",good:!0,mdxType:\"Guideline\"},\"In a single form, mark only the required fields or only the optional fields, depending on whichever is less frequent in the entire form. If most of the inputs are optional, only the required fields should be give an asterisk or have labels appended with \\u201C(required)\\u201D. If most of the inputs are required, only the optional fields should be appended with \\u201C(optional)\\u201D. An asterisk should never be used to note that an input is optional.\"),mdx(Guideline,{image:\"input-usage-guidelines-3-dont.svg\",bad:!0,mdxType:\"Guideline\"}),mdx(Guideline,{title:\"Use help text to show hints, formatting, and requirements\",image:\"input-usage-guidelines-4-do.svg\",good:!0,mdxType:\"Guideline\"},\"The description in the help text is flexible and encompasses a range of guidance. Sometimes this guidance is about what to input, and sometime it\\u2019s about how to input. This includes information such as:\",mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"An overall description of the input field\"),mdx(\"li\",{parentName:\"ul\"},\"Hints for what kind of information needs to be input\"),mdx(\"li\",{parentName:\"ul\"},\"Specific formatting examples or requirements\")),mdx(\"p\",null,`The help text\\u2019s message should not simply restate the same information in the\nlabel in order to prompt someone to interact with it. Don\\u2019t add help text if it\nisn\\u2019t actually relevant or meaningful to a user in order to try to maintain\nlayout continuity with other inputs that require help text.`)),mdx(Guideline,{image:\"input-usage-guidelines-4-dont.svg\",bad:!0,mdxType:\"Guideline\"}),mdx(Guideline,{title:\"Use help text instead of placeholder text\",image:\"input-usage-guidelines-5-do.svg\",good:!0,mdxType:\"Guideline\"},\"Putting instructions for how to complete an input, requirements, or any other essential information into placeholder text is not accessible, and should be avoided if possible. Once a value is entered, placeholder text is no longer viewable; if someone is using an automatic form filler, they will never get the information in the placeholder text. Instead of placeholder text, use the help text description to convey requirements or to show any formatting examples that would help user comprehension. If there's placeholder text and help text at the same time, it becomes redundant and distracting, and especially if they're communicating the same thing.\"),mdx(Guideline,{image:\"input-usage-guidelines-5-dont.svg\",bad:!0,mdxType:\"Guideline\"}),mdx(Guideline,{title:\"Switch help text with error text\",image:\"input-usage-guidelines-6-do.svg\",good:!0,mdxType:\"Guideline\"},\"The help text area also displays an error message. When a input already includes help text and an error is triggered, the help text is replaced with error text. Once the error is resolved, the help text description reappears below the field. Since one gets replaced by the other, the language of the help text and error text need to work together to convey the same messaging. Help text explains the requirement or adds supplementary context for how to successfully complete the input. Error text tells a user how to fix the error by re-stating the input requirements or describing the necessary interaction. Make sure that the help text and the error text include the same essential information so that it isn\\u2019t lost if one replaces the other (e.g., password requirements).\"),mdx(Guideline,{image:\"input-usage-guidelines-6-dont.svg\",bad:!0,mdxType:\"Guideline\"}),mdx(Guideline,{title:\"Write error text that shows a solution\",image:\"input-usage-guidelines-7-do.svg\",good:!0,mdxType:\"Guideline\"},\"Write error messaging in a human-centered way by guiding a user and showing them a solution \\u2014 don\\u2019t simply state what\\u2019s wrong and then leave them guessing as to how to resolve it. Ambiguous error messages can be frustrating and even shame-inducing for users. Also, keep in mind that something that a system may deem an error may not actually be perceived as an error to a user. Error text should be written in 1-2 short, complete sentences and in a clear and straightforward way. End sentences with a period, and never with an exclamation point. For inputs, the nature of the error is often related to something that needs to be fixed for in-line validation, so a helpful tone is most appropriate. For example, if someone were to miss filling out a required field that asks for their email address, write the error text like you\\u2019re offering a hint or a tip to help guide them to understand what needs to go in the missing field: \\u201CEnter your email address.\\u201D\"),mdx(Guideline,{image:\"input-usage-guidelines-7-dont.svg\",bad:!0,mdxType:\"Guideline\"}))}MDXContent.isMDXComponent=!0;\n","scope":{}}},"__N_SSG":true}