{"pageProps":{"source":{"compiledSource":"var d=Object.defineProperty,p=Object.defineProperties;var h=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,l=Object.prototype.propertyIsEnumerable;var r=(t,e,i)=>e in t?d(t,e,{enumerable:!0,configurable:!0,writable:!0,value:i}):t[e]=i,a=(t,e)=>{for(var i in e||(e={}))s.call(e,i)&&r(t,i,e[i]);if(n)for(var i of n(e))l.call(e,i)&&r(t,i,e[i]);return t},u=(t,e)=>p(t,h(e));var c=(t,e)=>{var i={};for(var o in t)s.call(t,o)&&e.indexOf(o)<0&&(i[o]=t[o]);if(t!=null&&n)for(var o of n(t))e.indexOf(o)<0&&l.call(t,o)&&(i[o]=t[o]);return i};const makeShortcode=t=>function(i){return console.warn(\"Component \"+t+\" was not imported, exported, or provided by MDXProvider as global scope\"),mdx(\"div\",a({},i))},Imagefullwidth=makeShortcode(\"Imagefullwidth\"),AssetLinks=makeShortcode(\"AssetLinks\"),AssetLink=makeShortcode(\"AssetLink\"),TableOfContents=makeShortcode(\"TableOfContents\"),Guideline=makeShortcode(\"Guideline\"),layoutProps={},MDXLayout=\"wrapper\";function MDXContent(i){var o=i,{components:t}=o,e=c(o,[\"components\"]);return mdx(MDXLayout,u(a(a({},layoutProps),e),{components:t,mdxType:\"MDXLayout\"}),mdx(\"h1\",null,\"Utility buttons\"),mdx(\"p\",null,`A utility button is a low priority action button that is used to highlight\nuseful functions. It is utilitarian, in that it\\u2019s designed to be useful or\npractical rather than attractive, not vying for attention like call-to-action\nbuttons and taking its place further down in the visual hierarchy.`),mdx(\"p\",null,`A utility button is often used when there are multiple similar actions on a page\nor when there are tools or components that require additional function.`),mdx(Imagefullwidth,{image:\"button-utility-hero.svg\",title:\"Utility button example\",mdxType:\"Imagefullwidth\"}),mdx(AssetLinks,{mdxType:\"AssetLinks\"},mdx(AssetLink,{href:\"https://react.fabric-ds.io/button\",mdxType:\"AssetLink\"}),mdx(AssetLink,{href:\"https://vue.fabric-ds.io/button\",mdxType:\"AssetLink\"})),mdx(TableOfContents,{mdxType:\"TableOfContents\"}),mdx(\"h2\",null,\"Anatomy\"),mdx(Imagefullwidth,{image:\"button-utility-anatomy.svg\",title:\"Utility button anatomy example\",mdxType:\"Imagefullwidth\"}),mdx(\"h2\",null,\"Options\"),mdx(Guideline,{title:\"Orientation\",image:\"button-utility-options-orientation.svg\",mdxType:\"Guideline\"},\"An action group can be either horizontal or vertical in its orientation. By default, an action group is horizontal. The vertical, or stacked, option should be reserved for when horizontal space is limited.\"),mdx(Guideline,{title:\"Density\",image:\"button-utility-options-density.svg\",mdxType:\"Guideline\"},\"Action groups come in 2 densities: regular and compact. The compact density retains the same font and icon sizes, but has tighter spacing. The action buttons also become connected for non-flat action groups.\"),mdx(Guideline,{title:\"Justified\",image:\"button-utility-options-justified.svg\",mdxType:\"Guideline\"},\"An action group can become justified. By default, it is not justified since the action button size depends on the label and/or icon inside each button. When an action group is justified, it takes up the entire available container width, divided equally for each action button that is inside the group.\"),mdx(Guideline,{title:\"Flat\",image:\"button-utility-options-flat.svg\",mdxType:\"Guideline\"},\"By default, an action group uses not-flat action buttons. This style works best in a dense array of controls where the background helps to separate action buttons from the surrounding container, or to give visibility to isolated buttons.\",mdx(\"p\",null,`Alternatively, flat action groups can have no visible background until they\\u2019re\ninteracted with. This style works best when a clear layout (vertical stack,\ntable, grid) makes it easy to parse the buttons. Too many quiet components in a\nsmall space can be hard to read.`)),mdx(Guideline,{title:\"Enable selection\",image:\"button-utility-options-enable-selection.svg\",mdxType:\"Guideline\"},\"By default, selection is not enabled in an action group. This is used for action groups that offer direct actions, rather than toggling.\",mdx(\"p\",null,`Selection can be enabled for an action group to allow for toggling. This can be\nused to disclose parts of an interface (e.g., showing or hiding panels) or to\nswitch between views (e.g., grid or list views).`)),mdx(Guideline,{title:\"Selection mode\",image:\"button-utility-options-selection-mode.svg\",mdxType:\"Guideline\"},\"When selection is enabled, an action group can allow for single or multiple selection of action buttons.\"),mdx(Guideline,{title:\"Emphasis\",image:\"button-utility-options-emphasis.svg\",mdxType:\"Guideline\"},\"Like action buttons, action groups are not emphasized by default. This is optimal for when the action group is not the core part of an interface, such as in application panels, where all components are monochrome in order to direct focus to the content.\",mdx(\"p\",null,`The emphasized action group has a blue background for its selected state in\norder to provide a visual prominence that meets the accessible color contrast\nratio. This is optimal for when the selection should call attention, such as\nwithin a tool bar.`)),mdx(Guideline,{title:\"Empty selection\",image:\"button-utility-options-empty-selection.svg\",mdxType:\"Guideline\"},\"When selection is enabled, an action group's selection behavior can be set to allow for an empty selection, or not.\"),mdx(Guideline,{title:\"Overflow menu\",image:\"button-utility-options-overflow-menu.svg\",mdxType:\"Guideline\"},\"When space is limited in an action group, there are 2 options for the group's overflow behavior: wrap or collapse. By default, an action group is set to wrap, meaning that the action buttons inside the group wrap to form another line. Alternatively, an action group can be set to collapse inside an overflow (...) action button.\"),mdx(Guideline,{title:\"Disabled\",image:\"button-utility-options-disabled.svg\",mdxType:\"Guideline\"},\"A action group in a disabled state shows that the action buttons within the group exist, but are not available in that circumstance. This state can be used to maintain layout continuity and to communicate that an action group may become available later.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}}},"__N_SSG":true}